shantanugoel/hearth/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_CODEC_ES8311_SUPPORT=y

# NOTE4 is ESP32-S3 N16R8: 16 MB flash, 8 MB octal PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# The NOTE4 exposes only USB-Serial/JTAG. Make USB the primary console so
# logs and the provisioning REPL work over /dev/ttyACM0.
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Hold-to-speak POST can block for local STT (up to 90 s).
CONFIG_ESP_TASK_WDT_TIMEOUT_S=120
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_LWIP_SO_RCVBUF=y

# Hub is HTTP on the LAN. Skip TLS to keep the image small.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n

# Hub URL is public on this LAN; SSID/password stay in sdkconfig.defaults.local.
CONFIG_HEARTH_HUB_URL="http://192.168.2.89:8790"
